<!DOCTYPE html>
<html lang="de" dir="ltr">
  <head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link rel="stylesheet" href="styles/main.css" />
    <link
      rel="stylesheet"
      href="https://fonts.googleapis.com/icon?family=Material+Icons"
    />
    <title>Daten und Codierung - Kryptologie</title>
    <link rel="icon" href="img/logo.ico" type="image/x-icon" />

    <script defer src="scripts/navigation.js"></script>
    <script defer src="scripts/caesar.js"></script>
  </head>
  <body>
    <div id="hero-fade">
      <img
        id="hero-img"
        src="https://images.unsplash.com/photo-1633265486064-086b219458ec?ixlib=rb-1.2.1&auto=format&fit=crop&w=1500"
        alt=""
      />
      <div id="hero-background"></div>
    </div>

    <main>
      <section id="hero-container">
        <h1>Kryptologie</h1>
        <p>
          Die Verschl&uuml;sselung von Daten war den Menschen schon immer
          wichtig. <br />
          Was dieser Bereich ist, wie er sich &uuml;ber Zeit entwickelte und wo
          man diesem heutzutage begegnet, haben wir euch in einem Video
          aufbereitet. Alternativ k&ouml;nnt ihr auch den Artikel lesen, der
          erg&auml;nzende Beispiele enth&auml;lt.
        </p>
        <a class="material-icons md-48 arrowDown" href="#Video">expand_more</a>
      </section>

      <header id="sticky-header">
        <input type="checkbox" id="nav-toggle" />
        <a href="index.html">Daten und Codierung</a>
        <nav>
          <a href="#Video">Video</a>
          <a href="#Allgemein">Allgemein</a>
          <a href="#Historisch">Historisch</a>
          <a href="#Im_Alltag">Im Alltag</a>
        </nav>
        <label for="nav-toggle" id="nav-toggle-icon"
          ><span class="material-icons">menu</span></label
        >
      </header>

      <section class="section-primary-dark" id="Video">
        <h2 class="primary-fade">Video</h2>
        <div class="grid">
          <iframe
            class="item item-long-horizontal"
            src="https://www.youtube.com/embed/XO7q3ka9L-I"
            title="YouTube video player"
            frameborder="0"
            allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
            allowfullscreen
          ></iframe>
        </div>
      </section>

      <img
        class="spacer"
        src="img/spacer/after-section-primary-dark.svg"
        alt=""
      />

      <section class="section-secondary" id="Allgemein">
        <h2 class="tertiary-fade heading-right">Allgemein</h2>
        <div class="grid">
          <p class="item item-long-horizontal">
            Kryptologie setzt sich aus den griechischen W&ouml;rtern kryptos und
            logos zusammen. Dies bedeutet jeweils so viel wie &ldquo;versteckt,
            verborgen oder geheim&rdquo; und &ldquo;Lehre und Kunde&rdquo;.
            Explizit beschreibt die Kryptologie die Wissenschaft vom Ver- und
            Entschl&uuml;sseln von Informationen. Dabei spaltet man die
            Kryptologie in noch 2 weitere Teile auf- der Kryptographie und der
            Kryptoanalyse. Die Kryptographie besch&auml;ftigt sich mit dem
            Entwerfen und der Anwendung der Verschl&uuml;sselungen an einer
            Information und die Kryptoanalyse untersucht deren Schwachstellen
            und St&auml;rken.
          </p>
          <p class="item">
            Man beschreibt beim Chiffrieren, also dem Verschl&uuml;sseln einer
            Nachricht zwischen verschiedenen Systemen. Beispielsweise wurden bei
            manchen Verschl&uuml;sselungen verschiedene Namen oder W&ouml;rter
            mit anderen ausgetauscht, sogenannten Codew&ouml;rtern.
            Beispielsweise wurde dabei der Name Hans durch das Wort Adler
            ausgetauscht.
          </p>
          <p class="item">
            Etwas komplexer werden die Chiffren, bei welchen nicht die
            W&ouml;rter ausgetauscht werden, sondern jeder einzelne Buchstabe.
            Hei&szlig;t in einem Text wird beispielsweise jeder Buchstabe e mit
            einem k ersetzt. Dadurch entsteht ein derart unverst&auml;ndlicher
            Buchstabensalat, dass es dem Leser unm&ouml;glich ist, auf den
            ersten Blick den eigentlichen Sinn hinter der Nachricht zu
            verstehen.
          </p>
        </div>
      </section>

      <img class="spacer" src="img/spacer/after-section-secondary.svg" alt="" />

      <section class="section-primary-light" id="Historisch">
        <h2 class="primary-fade">Historisch</h2>
        <div class="grid">
          <p class="item">
            Beispielsweise wurden viele Jahre vor Christus religi&ouml;se
            Schriften codiert, um sie geheim zu halten. Auch wurden auch
            spezielle Rezepturen verschl&uuml;sselt, welche Aufschluss auf
            antikes Wissen und Sch&auml;tze preisgeben k&ouml;nnten. So
            wei&szlig; die Menschheit immer noch nicht, wie damals die
            &Auml;gypter die Pyramiden bauten, weil man es schier nicht
            entziffern kann.
          </p>
          <figure class="item">
            <img
              src="https://images.unsplash.com/photo-1519884705082-b505c3001e63?ixlib=rb-1.2.1&auto=format&fit=crop&w=1500"
              alt=""
            />
            <figcaption>
              Bild von
              <a
                href="https://unsplash.com/@svalenas?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText"
                >Sergiu Vălenaș</a
              >
              auf
              <a
                href="https://unsplash.com/s/photos/old-book?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText"
                >Unsplash</a
              >
            </figcaption>
          </figure>
          <p class="item item-long-horizontal">
            Ein weiterer sehr wichtiger Einsatzbereich von
            Verschl&uuml;sselungen sind Kriege. Beispielsweise werden
            Flottensignale ausschlie&szlig;lich verschl&uuml;sselt
            &uuml;bermittelt, zum Schutz vor m&ouml;glichen Abh&ouml;rern.
            Verschl&uuml;sselte Informationen zu entschl&uuml;sseln war ein
            wichtiger Aspekt, der h&auml;ufig &uuml;ber Sieg und Niederlage
            entschied. Eines der bekanntesten Beispiele hierbei ist die wohl
            bekannteste Chiffriermaschine der Geschichte: die Enigma, bzw. die
            Enigma 2. Diese ist eine Apparatur, welche nicht un&auml;hnlich
            einer Schreibmaschine ist. Allerdings ist sie in der Lage &uuml;ber
            mehrere Rotoren, Key Switches und Walzen innerhalb k&uuml;rzester
            Zeit beinahe unknackbare Chiffren zu generieren. Mittels weniger
            Handgriffe konnte der Chiffrierschl&uuml;ssel ge&auml;ndert und
            somit der Prozess der Dechiffrierung wieder auf 0 gesetzt werden. Im
            2. Weltkrieg wurde die Enigma von den Nazis genutzt, um ihre
            Angriffspl&auml;ne weiterzuleiten. Die Chiffren der Enigma wurden
            als unknackbar angesehen, bis es Alan Turing gelang, sie mittels des
            seines ersten Computers zu entziffern.
          </p>
          <p class="item">
            Und dort liegt ein springender Punkt: So gut wie jedes System kann
            gebrochen werden. &quot;No system is safe.&quot; Beispielsweise kann
            man bei den vertauschten Buchstaben einfach die H&auml;ufigkeit der
            einzelnen Buchstaben z&auml;hlen und beim h&auml;ufigsten davon
            ausgehen, dass es ein e ist.
          </p>
          <figure class="item">
            <img
              src="https://images.unsplash.com/photo-1618060931775-18ed14951776?ixlib=rb-1.2.1&auto=format&fit=crop&w=1500"
              alt=""
            />
            <figcaption>
              Bild von
              <a
                href="https://unsplash.com/@flyd2069?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText"
                >FLY:D</a
              >
              auf
              <a
                href="https://unsplash.com/s/photos/cyber-security?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText"
                >Unsplash</a
              >
            </figcaption>
          </figure>
          <p class="item item-long-horizontal">
            Ein Reisender musste in seiner Herberge schnell abreisen, lies
            jedoch seinen Koffer dort. Er meinte, dass in den kommenden Tagen
            ein Brief auf die Betreiber der Herberge zukommen w&uuml;rde.<br />
            Au&szlig;erdem meinte er, dass sie den Koffer 10 Jahre lang
            verwahren sollte. Sollte nach 10 Jahren der Koffer nicht abgeholt
            werden, d&uuml;rfen sie den Koffer behalten. Wenig sp&auml;ter kam
            der Brief. Darin stand, dass der Inhalt des Koffers
            verschl&uuml;sselt sei, und in einem zweiten Brief sei der
            Schl&uuml;ssel der Codierung. Der zweite Brief kam jedoch nie an.
            Nach 10 Jahren wurde der Koffer ge&ouml;ffnet, da niemand ihn
            abholte. Im Koffer waren 3 Bl&auml;tter Papier, welche mit vielen
            Zahlen &uuml;bers&auml;t waren. &Uuml;ber viele Jahre wurden diese 3
            Bl&auml;tter mittels der verschiedensten Dechiffrierungsarten
            untersucht und behandelt. Irgendwann haben sie es geschafft, das 2.
            Blatt zu &uuml;bersetzen, und es war von einem Schatz die Rede.
          </p>
          <p class="item">
            Die Art der Chiffrierung war so einfach wie genial - jede Zahl auf
            dem Papier entsprach dem n-ten Wort der amerikanischen
            Unabh&auml;ngigkeitserkl&auml;rung. Die anderen beiden Bl&auml;tter
            hatten jedoch einen anderen Chiffrierschl&uuml;ssel, also eine
            andere Textgrundlage, wodurch sie bisher noch nicht
            entschl&uuml;sselt werden konnten. Somit wurde der Schatz noch nicht
            gefunden, dessen Existenz bis heute nicht gekl&auml;rt ist. Bis
            heute stellt sich noch immer die Frage, ob die Papiere des Thomas J.
            Beale wirklich zu einem Schatz f&uuml;hren oder doch nur ein
            genialer, aber nutzloser Scherz sind.
          </p>

          <figure class="item">
            <img
              style="background: rgb(var(--color-text-light))"
              src="https://upload.wikimedia.org/wikipedia/commons/7/71/Beale_2.svg"
              alt=""
            />
            <figcaption>
              Bild von
              <a href="https://de.wikipedia.org/wiki/Beale-Chiffre"
                >Wikipedia</a
              >
            </figcaption>
          </figure>
          <p class="item">
            Man ersetzt bei der Caesar-Scheibe die &auml;u&szlig;eren Buchstaben
            durch die inneren, indem man den inneren Kreis bewegt. In diesem
            Bild w&auml;re einmal ein richtiges B im Geheimtext ein E, das
            andere Mal w&auml;re es ein P.<br />
          </p>
          <figure class="item item-long-vertical">
            <img src="https://cscx.org/caesar3.svg" alt="" />
            <figcaption>
              Bild von
              <a href="https://cscx.org/caesar">Computer Science by Example</a>
            </figcaption>
          </figure>
          <form class="item">
            <p>
              Hier k&ouml;nnt ihr es einmal austesten, Sonderzeichen werden in
              der Chiffrierung ignoriert.
            </p>
            <label for="caesar-cipher-offset">A wird zu:</label>
            <input
              placeholder="T"
              id="caesar-cipher-offset"
              type="text"
              maxlength="1"
            />
            <br />

            <label for="caesar-cipher-input">Original Text:</label>
            <input
              placeholder="BEISPIEL"
              id="caesar-cipher-input"
              type="text"
            />
            <br />

            <label for="caesar-cipher-output"
              >Caesar-Verschl&uuml;sselung:</label
            >
            <br />
            <output id="caesar-cipher-output">Fehler</output>
          </form>
        </div>
      </section>

      <img
        class="spacer"
        src="img/spacer/after-section-primary-light.svg"
        alt=""
      />

      <section class="section-tertiary" id="Im_Alltag">
        <h2 class="secondary-fade heading-right">Im Alltag</h2>
        <div class="grid">
          <p class="item item-long-horizontal">
            Tats&auml;chlich werden Verschl&uuml;sselungen &ouml;fters genutzt,
            als man es eventuell manchmal glaubt. Allein wenn man mal auf eine
            URL guckt, sieht man dort immer dieses mysteri&ouml;se
            &quot;https&quot;. Auch beim Einloggen in ein WLAN oder beim
            Bezahlen mit einer EC-Karte kommen Verschl&uuml;sselungen zum
            Tragen. Alle wichtigen Informationen m&uuml;ssen irgendwie
            verschl&uuml;sselt werden, um den Zugriff von Unbefugten nicht
            zuzulassen bzw. Hackern das Knacken eines Systems noch weiter zu
            erschweren.
          </p>
          <p class="item item-long-vertical">
            Vor allem bei der Kommunikation zwischen 2 Rechnern ist dies
            besonders wichtig. Diese erfolgt mit sogenannten SSL oder TLS
            Protokollen. Dort wird ein Schl&uuml;ssel f&uuml;r beide Rechner zur
            Verf&uuml;gung gestellt, &uuml;ber den die Rechner
            verschl&uuml;sselt miteinander kommunizieren k&ouml;nnen. Dort
            werden dann alle Nachrichten verschl&uuml;sselt, welche der andere
            Rechner entschl&uuml;sseln kann. Au&szlig;erdem wird eine Art
            &ldquo;Fingerabdruck&rdquo; berechnet, wodurch der andere Rechner
            genau wei&szlig;, ob die jeweilige Nachricht auch von dem richtigen
            Rechner gesendet wurde.
          </p>
          <p class="item">
            Das https auf Webseiten steht f&uuml;r Hyper Text Transfer Protocol
            Secure und arbeitet mit den weiterentwickelten TLS-Protokollen,
            w&auml;hrend die &uuml;blichen http-&Uuml;bertragungen noch mit
            SSL-Protokollen funktionieren.
          </p>
          <p class="item">
            HTTPS hat gegen&uuml;ber HTTP 2 zwei entscheidende Vorteile: Der
            Browser eines Computers und der Webserver der angesteuerten
            Internet-Seite authentifizieren sich gegenseitig und die Daten, die
            diese beiden Sender und Empf&auml;nger austauschen, von Anfang an
            verschl&uuml;sselt werden. Ohne dieses kleine s am Ende sind die
            Webseiten also deutlich unsicher und damit sogar eventuell
            gef&auml;hrlich.
          </p>
        </div>
      </section>

      <img class="spacer" src="img/spacer/after-section-tertiary.svg" alt="" />

      <section class="section-primary-dark" id="Quellen">
        <h2 class="tertiary-fade heading-right">Quellen</h2>
        <dl class="item">
          <dt>Hero Image</dt>
          <dd>
            Bild von
            <a
              href="https://unsplash.com/@towfiqu999999?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText"
              >Towfiqu barbhuiya</a
            >
            auf
            <a
              href="https://unsplash.com/s/photos/cyber-security?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText"
              >Unsplash</a
            >
          </dd>

          <dt>Allgemein</dt>
          <dd>
            <a href="https://de.wikipedia.org/wiki/Kryptologie"
              >Kryptologie (Wikipedia)</a
            >
          </dd>

          <dt>Historisch</dt>
          <dd>
            <a
              href="https://www.deutsches-spionagemuseum.de/2021/03/25/geschichte-der-kryptologie-1-altertum"
              >Geschichte der Kryptologie (Deutsches Spionagemuseum)</a
            >
          </dd>
          <dd>
            <a href="https://de.wikipedia.org/wiki/Beale-Chiffre"
              >Beale-Chiffre (Wikipedia)</a
            >
          </dd>
          <dd>
            <a href="https://de.wikipedia.org/wiki/Caesar-Verschl%C3%BCsselung"
              >Caesar-Verschl%C3%BCsselung (Wikipedia)</a
            >
          </dd>

          <dt>Im Alltag</dt>
          <dd>
            <a
              href="https://www.planet-wissen.de/natur/forschung/kryptologie_die_lehre_des_verborgenen/pwiekryptologieimalltag100.html"
              >Kryptologie im Alltag (Planet Wissen)</a
            >
          </dd>
        </dl>
      </section>

      <footer>
        <nav>
          <a href="index.html">Startseite</a>
          <a href="impressum.html">Impressum</a>
        </nav>
      </footer>
    </main>
  </body>
</html>
